# PointCloudOverrideSettings Properties

---
The PointCloudOverrideSettings type exposes the following members.
| Name| Description
---|---|---
| ColorMode|  The current color mode for the PointCloudInstance element or its scan.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Visible|  Visibility flag for point cloud scans.
Top
#### Reference
PointCloudOverrideSettings Class
Autodesk.Revit.DB.PointClouds Namespace